In [31]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline

In [55]:
df = pd.read_csv('btc-market-price.csv')

In [56]:
df

     2017-04-02 00:00:00  1099.169125
0    2017-04-03 00:00:00  1141.813000
1    2017-04-04 00:00:00  1141.600363
2    2017-04-05 00:00:00  1133.079314
3    2017-04-06 00:00:00  1196.307937
4    2017-04-07 00:00:00  1190.454250
..                   ...          ...
359  2018-03-28 00:00:00  7960.380000
360  2018-03-29 00:00:00  7172.280000
361  2018-03-30 00:00:00  6882.531667
362  2018-03-31 00:00:00  6935.480000
363  2018-04-01 00:00:00  6794.105000

[364 rows x 2 columns]

In [57]:
df.head()

   2017-04-02 00:00:00  1099.169125
0  2017-04-03 00:00:00  1141.813000
1  2017-04-04 00:00:00  1141.600363
2  2017-04-05 00:00:00  1133.079314
3  2017-04-06 00:00:00  1196.307937
4  2017-04-07 00:00:00  1190.454250

In [58]:
df.tail(3)

     2017-04-02 00:00:00  1099.169125
361  2018-03-30 00:00:00  6882.531667
362  2018-03-31 00:00:00  6935.480000
363  2018-04-01 00:00:00  6794.105000

In [59]:
df=pd.read_csv('btc-market-price.csv',header=None)  #when we do header=None it will not take the 1st row as heading 
df

                       0            1
0    2017-04-02 00:00:00  1099.169125
1    2017-04-03 00:00:00  1141.813000
2    2017-04-04 00:00:00  1141.600363
3    2017-04-05 00:00:00  1133.079314
4    2017-04-06 00:00:00  1196.307937
..                   ...          ...
360  2018-03-28 00:00:00  7960.380000
361  2018-03-29 00:00:00  7172.280000
362  2018-03-30 00:00:00  6882.531667
363  2018-03-31 00:00:00  6935.480000
364  2018-04-01 00:00:00  6794.105000

[365 rows x 2 columns]

In [60]:
df.columns=['Timestamp','Price']

In [61]:
df

               Timestamp        Price
0    2017-04-02 00:00:00  1099.169125
1    2017-04-03 00:00:00  1141.813000
2    2017-04-04 00:00:00  1141.600363
3    2017-04-05 00:00:00  1133.079314
4    2017-04-06 00:00:00  1196.307937
..                   ...          ...
360  2018-03-28 00:00:00  7960.380000
361  2018-03-29 00:00:00  7172.280000
362  2018-03-30 00:00:00  6882.531667
363  2018-03-31 00:00:00  6935.480000
364  2018-04-01 00:00:00  6794.105000

[365 rows x 2 columns]

In [62]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

In [64]:
df['Timestamp']=pd.to_datetime(df['Timestamp'])  #from object to date&time

In [65]:
df

     Timestamp        Price
0   2017-04-02  1099.169125
1   2017-04-03  1141.813000
2   2017-04-04  1141.600363
3   2017-04-05  1133.079314
4   2017-04-06  1196.307937
..         ...          ...
360 2018-03-28  7960.380000
361 2018-03-29  7172.280000
362 2018-03-30  6882.531667
363 2018-03-31  6935.480000
364 2018-04-01  6794.105000

[365 rows x 2 columns]

In [69]:
df.dtypes

Price    float64
dtype: object

In [72]:
# df.set_index('Timestamp', inplace=True)
#

In [73]:
df

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937
...                 ...
2018-03-28  7960.380000
2018-03-29  7172.280000
2018-03-30  6882.531667
2018-03-31  6935.480000
2018-04-01  6794.105000

[365 rows x 1 columns]

In [74]:
df.loc['2017-09-29']

Price    4193.574667
Name: 2017-09-29 00:00:00, dtype: float64

In [75]:
df.index

DatetimeIndex(['2017-04-02', '2017-04-03', '2017-04-04', '2017-04-05',
               '2017-04-06', '2017-04-07', '2017-04-08', '2017-04-09',
               '2017-04-10', '2017-04-11',
               ...
               '2018-03-23', '2018-03-24', '2018-03-25', '2018-03-26',
               '2018-03-27', '2018-03-28', '2018-03-29', '2018-03-30',
               '2018-03-31', '2018-04-01'],
              dtype='datetime64[ns]', name='Timestamp', length=365, freq=None)